iceghost/231-microprocessor/STM32F103C6/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.h
 * @brief          : Header for main.c file.
 *                   This file contains the common defines of the application.
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2023 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdbool.h>
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_V_R_Pin GPIO_PIN_5
#define LED_V_R_GPIO_Port GPIOA
#define LED_V_Y_Pin GPIO_PIN_6
#define LED_V_Y_GPIO_Port GPIOA
#define LED_V_G_Pin GPIO_PIN_7
#define LED_V_G_GPIO_Port GPIOA
#define LED_H_R_Pin GPIO_PIN_0
#define LED_H_R_GPIO_Port GPIOB
#define LED_H_Y_Pin GPIO_PIN_1
#define LED_H_Y_GPIO_Port GPIOB
#define LED_H_G_Pin GPIO_PIN_2
#define LED_H_G_GPIO_Port GPIOB
#define SEG_V_A_Pin GPIO_PIN_8
#define SEG_V_A_GPIO_Port GPIOA
#define SEG_V_B_Pin GPIO_PIN_9
#define SEG_V_B_GPIO_Port GPIOA
#define SEG_V_C_Pin GPIO_PIN_10
#define SEG_V_C_GPIO_Port GPIOA
#define SEG_V_D_Pin GPIO_PIN_11
#define SEG_V_D_GPIO_Port GPIOA
#define SEG_V_E_Pin GPIO_PIN_12
#define SEG_V_E_GPIO_Port GPIOA
#define SEG_V_F_Pin GPIO_PIN_13
#define SEG_V_F_GPIO_Port GPIOA
#define SEG_V_G_Pin GPIO_PIN_14
#define SEG_V_G_GPIO_Port GPIOA
#define SEG_H_A_Pin GPIO_PIN_3
#define SEG_H_A_GPIO_Port GPIOB
#define SEG_H_B_Pin GPIO_PIN_4
#define SEG_H_B_GPIO_Port GPIOB
#define SEG_H_C_Pin GPIO_PIN_5
#define SEG_H_C_GPIO_Port GPIOB
#define SEG_H_D_Pin GPIO_PIN_6
#define SEG_H_D_GPIO_Port GPIOB
#define SEG_H_E_Pin GPIO_PIN_7
#define SEG_H_E_GPIO_Port GPIOB
#define SEG_H_F_Pin GPIO_PIN_8
#define SEG_H_F_GPIO_Port GPIOB
#define SEG_H_G_Pin GPIO_PIN_9
#define SEG_H_G_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */
#define SOFTWARE_TIMERS_COUNT 2
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
